Tested on `tempdev`

## tempdev.shared plan

```
Terraform will perform the following actions:

  # aws_cloudwatch_log_group.default will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "default" {
        id                = "/aws/vpc/azul-default-tempdev"
        name              = "/aws/vpc/azul-default-tempdev"
      ~ retention_in_days = 180 -> 365
        tags              = {
            "Name"                = "azul-default"
            "billing"             = "anvil"
            "component"           = "azul-default"
            "deployment"          = "tempdev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "shared"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.trail will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "trail" {
        id                = "azul-trail-tempdev"
        name              = "azul-trail-tempdev"
      ~ retention_in_days = 180 -> 365
        tags              = {
            "Name"                = "azul-trail"
            "billing"             = "anvil"
            "component"           = "azul-trail"
            "deployment"          = "tempdev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "shared"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_s3_bucket_lifecycle_configuration.logs will be updated in-place
  ~ resource "aws_s3_bucket_lifecycle_configuration" "logs" {
        id                                     = "edu-ucsc-gi-platform-temp-dev-logs.us-east-1"
        # (3 unchanged attributes hidden)

      ~ rule {
          ~ id     = "expire" -> "expire-alb-access"
            # (2 unchanged attributes hidden)

          ~ expiration {
              ~ days                         = 90 -> 365
                # (2 unchanged attributes hidden)
            }

          ~ filter {
              + prefix                   = "alb/access/"
                # (2 unchanged attributes hidden)
            }
        }
      + rule {
          + id     = "expire-s3-access"
          + status = "Enabled"

          + expiration {
              + days = 365
            }

          + filter {
              + prefix = "s3/access/"
            }
        }
      + rule {
          + id     = "expire-bucket-inventory"
          + status = "Enabled"

          + expiration {
              + days = 365
            }

          + filter {
              + prefix = "inventory/"
            }
        }
    }

  # aws_s3_bucket_lifecycle_configuration.trail will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "trail" {
      + bucket                                 = "edu-ucsc-gi-platform-temp-dev-logs.us-east-1"
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = (known after apply)

      + rule {
          + id     = "expire"
          + status = "Enabled"

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
            }
        }
    }

Plan: 1 to add, 3 to change, 0 to destroy.

```

## tempdev plan

```
Terraform will perform the following actions:

  # aws_cloudwatch_log_group.error_log will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "error_log" {
        id                = "/aws/aes/domains/azul-index-tempdev/error-logs"
        name              = "/aws/aes/domains/azul-index-tempdev/error-logs"
      ~ retention_in_days = 180 -> 365
        tags              = {
            "Name"       = "azul-error_log-tempdev"
            "billing"    = "anvil"
            "component"  = "azul-error_log"
            "deployment" = "tempdev"
            "owner"      = "hannes@ucsc.edu"
            "service"    = "azul"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.index_log will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "index_log" {
        id                = "/aws/aes/domains/azul-index-tempdev/index-logs"
        name              = "/aws/aes/domains/azul-index-tempdev/index-logs"
      ~ retention_in_days = 180 -> 365
        tags              = {
            "Name"       = "azul-index_log-tempdev"
            "billing"    = "anvil"
            "component"  = "azul-index_log"
            "deployment" = "tempdev"
            "owner"      = "hannes@ucsc.edu"
            "service"    = "azul"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer" {
        id                = "/aws/apigateway/azul-indexer-tempdev"
        name              = "/aws/apigateway/azul-indexer-tempdev"
      ~ retention_in_days = 180 -> 365
        tags              = {
            "Name"       = "azul-indexer-tempdev"
            "billing"    = "anvil"
            "component"  = "azul-indexer"
            "deployment" = "tempdev"
            "owner"      = "hannes@ucsc.edu"
            "service"    = "azul"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.search_log will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "search_log" {
        id                = "/aws/aes/domains/azul-index-tempdev/search-logs"
        name              = "/aws/aes/domains/azul-index-tempdev/search-logs"
      ~ retention_in_days = 180 -> 365
        tags              = {
            "Name"       = "azul-search_log-tempdev"
            "billing"    = "anvil"
            "component"  = "azul-search_log"
            "deployment" = "tempdev"
            "owner"      = "hannes@ucsc.edu"
            "service"    = "azul"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.service will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "service" {
        id                = "/aws/apigateway/azul-service-tempdev"
        name              = "/aws/apigateway/azul-service-tempdev"
      ~ retention_in_days = 180 -> 365
        tags              = {
            "Name"       = "azul-service-tempdev"
            "billing"    = "anvil"
            "component"  = "azul-service"
            "deployment" = "tempdev"
            "owner"      = "hannes@ucsc.edu"
            "service"    = "azul"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.waf_api_gateway will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "waf_api_gateway" {
        id                = "aws-waf-logs-azul-api_gateway-tempdev"
        name              = "aws-waf-logs-azul-api_gateway-tempdev"
      ~ retention_in_days = 180 -> 365
        tags              = {
            "Name"       = "azul-waf_api_gateway-tempdev"
            "billing"    = "anvil"
            "component"  = "azul-waf_api_gateway"
            "deployment" = "tempdev"
            "owner"      = "hannes@ucsc.edu"
            "service"    = "azul"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_lambda_function.indexer will be updated in-place
  ~ resource "aws_lambda_function" "indexer" {
        id                             = "azul-indexer-tempdev"
      ~ last_modified                  = "2025-01-16T00:09:21.440+0000" -> (known after apply)
      ~ source_code_hash               = "lQ2NPQWSPmX2bfUOFLQIoV1tN8N5y3an+gsvpWw3Mns=" -> "tTDNWHmhqOK8tbkH1shhL0CYmT5NaV+sogclm1JbJ4A="
        tags                           = {
            "Name"        = "azul-indexer-tempdev"
            "aws-chalice" = "version=1.31.3:stage=tempdev:app=azul-indexer"
            "billing"     = "anvil"
            "component"   = "azul-indexer"
            "deployment"  = "tempdev"
            "owner"       = "hannes@ucsc.edu"
            "service"     = "azul"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "f9e4c5d20fdc80374e5465360c7cbedf3b367d1d" -> "d9c66cce440b57fbae0a7f6a8679831f4a9012d5"
                # (43 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.indexer_aggregate will be updated in-place
  ~ resource "aws_lambda_function" "indexer_aggregate" {
        id                             = "azul-indexer-tempdev-aggregate"
      ~ last_modified                  = "2025-01-16T00:17:50.096+0000" -> (known after apply)
      ~ source_code_hash               = "lQ2NPQWSPmX2bfUOFLQIoV1tN8N5y3an+gsvpWw3Mns=" -> "tTDNWHmhqOK8tbkH1shhL0CYmT5NaV+sogclm1JbJ4A="
        tags                           = {
            "Name"        = "azul-indexer_aggregate-tempdev"
            "aws-chalice" = "version=1.31.3:stage=tempdev:app=azul-indexer"
            "billing"     = "anvil"
            "component"   = "azul-indexer_aggregate"
            "deployment"  = "tempdev"
            "owner"       = "hannes@ucsc.edu"
            "service"     = "azul"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "f9e4c5d20fdc80374e5465360c7cbedf3b367d1d" -> "d9c66cce440b57fbae0a7f6a8679831f4a9012d5"
                # (43 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.indexer_aggregate_retry will be updated in-place
  ~ resource "aws_lambda_function" "indexer_aggregate_retry" {
        id                             = "azul-indexer-tempdev-aggregate_retry"
      ~ last_modified                  = "2025-01-16T00:18:09.130+0000" -> (known after apply)
      ~ source_code_hash               = "lQ2NPQWSPmX2bfUOFLQIoV1tN8N5y3an+gsvpWw3Mns=" -> "tTDNWHmhqOK8tbkH1shhL0CYmT5NaV+sogclm1JbJ4A="
        tags                           = {
            "Name"        = "azul-indexer_aggregate_retry-tempdev"
            "aws-chalice" = "version=1.31.3:stage=tempdev:app=azul-indexer"
            "billing"     = "anvil"
            "component"   = "azul-indexer_aggregate_retry"
            "deployment"  = "tempdev"
            "owner"       = "hannes@ucsc.edu"
            "service"     = "azul"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "f9e4c5d20fdc80374e5465360c7cbedf3b367d1d" -> "d9c66cce440b57fbae0a7f6a8679831f4a9012d5"
                # (43 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.indexer_contribute will be updated in-place
  ~ resource "aws_lambda_function" "indexer_contribute" {
        id                             = "azul-indexer-tempdev-contribute"
      ~ last_modified                  = "2025-01-16T00:17:59.661+0000" -> (known after apply)
      ~ source_code_hash               = "lQ2NPQWSPmX2bfUOFLQIoV1tN8N5y3an+gsvpWw3Mns=" -> "tTDNWHmhqOK8tbkH1shhL0CYmT5NaV+sogclm1JbJ4A="
        tags                           = {
            "Name"        = "azul-indexer_contribute-tempdev"
            "aws-chalice" = "version=1.31.3:stage=tempdev:app=azul-indexer"
            "billing"     = "anvil"
            "component"   = "azul-indexer_contribute"
            "deployment"  = "tempdev"
            "owner"       = "hannes@ucsc.edu"
            "service"     = "azul"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "f9e4c5d20fdc80374e5465360c7cbedf3b367d1d" -> "d9c66cce440b57fbae0a7f6a8679831f4a9012d5"
                # (43 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.indexer_contribute_retry will be updated in-place
  ~ resource "aws_lambda_function" "indexer_contribute_retry" {
        id                             = "azul-indexer-tempdev-contribute_retry"
      ~ last_modified                  = "2025-01-16T00:17:13.801+0000" -> (known after apply)
      ~ source_code_hash               = "lQ2NPQWSPmX2bfUOFLQIoV1tN8N5y3an+gsvpWw3Mns=" -> "tTDNWHmhqOK8tbkH1shhL0CYmT5NaV+sogclm1JbJ4A="
        tags                           = {
            "Name"        = "azul-indexer_contribute_retry-tempdev"
            "aws-chalice" = "version=1.31.3:stage=tempdev:app=azul-indexer"
            "billing"     = "anvil"
            "component"   = "azul-indexer_contribute_retry"
            "deployment"  = "tempdev"
            "owner"       = "hannes@ucsc.edu"
            "service"     = "azul"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "f9e4c5d20fdc80374e5465360c7cbedf3b367d1d" -> "d9c66cce440b57fbae0a7f6a8679831f4a9012d5"
                # (43 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.indexer_forward_alb_logs will be updated in-place
  ~ resource "aws_lambda_function" "indexer_forward_alb_logs" {
        id                             = "azul-indexer-tempdev-forward_alb_logs"
      ~ last_modified                  = "2025-01-16T00:17:41.231+0000" -> (known after apply)
      ~ source_code_hash               = "lQ2NPQWSPmX2bfUOFLQIoV1tN8N5y3an+gsvpWw3Mns=" -> "tTDNWHmhqOK8tbkH1shhL0CYmT5NaV+sogclm1JbJ4A="
        tags                           = {
            "Name"        = "azul-indexer_forward_alb_logs-tempdev"
            "aws-chalice" = "version=1.31.3:stage=tempdev:app=azul-indexer"
            "billing"     = "anvil"
            "component"   = "azul-indexer_forward_alb_logs"
            "deployment"  = "tempdev"
            "owner"       = "hannes@ucsc.edu"
            "service"     = "azul"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "f9e4c5d20fdc80374e5465360c7cbedf3b367d1d" -> "d9c66cce440b57fbae0a7f6a8679831f4a9012d5"
                # (43 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.indexer_forward_s3_logs will be updated in-place
  ~ resource "aws_lambda_function" "indexer_forward_s3_logs" {
        id                             = "azul-indexer-tempdev-forward_s3_logs"
      ~ last_modified                  = "2025-01-16T00:17:32.145+0000" -> (known after apply)
      ~ source_code_hash               = "lQ2NPQWSPmX2bfUOFLQIoV1tN8N5y3an+gsvpWw3Mns=" -> "tTDNWHmhqOK8tbkH1shhL0CYmT5NaV+sogclm1JbJ4A="
        tags                           = {
            "Name"        = "azul-indexer_forward_s3_logs-tempdev"
            "aws-chalice" = "version=1.31.3:stage=tempdev:app=azul-indexer"
            "billing"     = "anvil"
            "component"   = "azul-indexer_forward_s3_logs"
            "deployment"  = "tempdev"
            "owner"       = "hannes@ucsc.edu"
            "service"     = "azul"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "f9e4c5d20fdc80374e5465360c7cbedf3b367d1d" -> "d9c66cce440b57fbae0a7f6a8679831f4a9012d5"
                # (43 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.indexer_indexercachehealth will be updated in-place
  ~ resource "aws_lambda_function" "indexer_indexercachehealth" {
        id                             = "azul-indexer-tempdev-indexercachehealth"
      ~ last_modified                  = "2025-01-16T00:17:04.795+0000" -> (known after apply)
      ~ source_code_hash               = "lQ2NPQWSPmX2bfUOFLQIoV1tN8N5y3an+gsvpWw3Mns=" -> "tTDNWHmhqOK8tbkH1shhL0CYmT5NaV+sogclm1JbJ4A="
        tags                           = {
            "Name"        = "azul-indexer_indexercachehealth-tempdev"
            "aws-chalice" = "version=1.31.3:stage=tempdev:app=azul-indexer"
            "billing"     = "anvil"
            "component"   = "azul-indexer_indexercachehealth"
            "deployment"  = "tempdev"
            "owner"       = "hannes@ucsc.edu"
            "service"     = "azul"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "f9e4c5d20fdc80374e5465360c7cbedf3b367d1d" -> "d9c66cce440b57fbae0a7f6a8679831f4a9012d5"
                # (43 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.service will be updated in-place
  ~ resource "aws_lambda_function" "service" {
        id                             = "azul-service-tempdev"
      ~ last_modified                  = "2025-01-16T00:18:18.288+0000" -> (known after apply)
      ~ source_code_hash               = "pULsDh/sPRcuDBGD9c0i+WfMHGFQ5kMnEoiS70OQzjY=" -> "OQ147D4rzOXNY0X+p6tKQWu7hdvGPvw1yDAIuhIPtvA="
        tags                           = {
            "Name"        = "azul-service-tempdev"
            "aws-chalice" = "version=1.31.3:stage=tempdev:app=azul-service"
            "billing"     = "anvil"
            "component"   = "azul-service"
            "deployment"  = "tempdev"
            "owner"       = "hannes@ucsc.edu"
            "service"     = "azul"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "f9e4c5d20fdc80374e5465360c7cbedf3b367d1d" -> "d9c66cce440b57fbae0a7f6a8679831f4a9012d5"
                # (43 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.service_manifest will be updated in-place
  ~ resource "aws_lambda_function" "service_manifest" {
        id                             = "azul-service-tempdev-manifest"
      ~ last_modified                  = "2025-01-16T00:13:18.215+0000" -> (known after apply)
      ~ source_code_hash               = "pULsDh/sPRcuDBGD9c0i+WfMHGFQ5kMnEoiS70OQzjY=" -> "OQ147D4rzOXNY0X+p6tKQWu7hdvGPvw1yDAIuhIPtvA="
        tags                           = {
            "Name"        = "azul-service_manifest-tempdev"
            "aws-chalice" = "version=1.31.3:stage=tempdev:app=azul-service"
            "billing"     = "anvil"
            "component"   = "azul-service_manifest"
            "deployment"  = "tempdev"
            "owner"       = "hannes@ucsc.edu"
            "service"     = "azul"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "f9e4c5d20fdc80374e5465360c7cbedf3b367d1d" -> "d9c66cce440b57fbae0a7f6a8679831f4a9012d5"
                # (43 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.service_servicecachehealth will be updated in-place
  ~ resource "aws_lambda_function" "service_servicecachehealth" {
        id                             = "azul-service-tempdev-servicecachehealth"
      ~ last_modified                  = "2025-01-16T00:17:22.979+0000" -> (known after apply)
      ~ source_code_hash               = "pULsDh/sPRcuDBGD9c0i+WfMHGFQ5kMnEoiS70OQzjY=" -> "OQ147D4rzOXNY0X+p6tKQWu7hdvGPvw1yDAIuhIPtvA="
        tags                           = {
            "Name"        = "azul-service_servicecachehealth-tempdev"
            "aws-chalice" = "version=1.31.3:stage=tempdev:app=azul-service"
            "billing"     = "anvil"
            "component"   = "azul-service_servicecachehealth"
            "deployment"  = "tempdev"
            "owner"       = "hannes@ucsc.edu"
            "service"     = "azul"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "f9e4c5d20fdc80374e5465360c7cbedf3b367d1d" -> "d9c66cce440b57fbae0a7f6a8679831f4a9012d5"
                # (43 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 17 to change, 0 to destroy.
```

